IDEA Open Model
ConcDiagramType Enumeration
Compatible with IDEA StatiCa 20.1
 Concrete stress-strain diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ConcDiagramType
Public Enumeration ConcDiagramType
Members
Member name | Value | Description
Bilinear | 0 |  Bilinear type
Parabolic | 1 |  Parabolic type
DefinedByUser | 2 |  Defined by user
See Also
Reference
IdeaRS.OpenModel.Material Namespace